// ------以下为答题过程中的草稿
// function delete_double_order(array) {
// ​    const arr = {};
//     for(var i=0; i < array.lenth; i++){
//       var j = 0;
//       if(array[j] === array[i]) {
//         j++;
//       }
//       if(j<=1)
//       return array;
//     }
//     return array.sort();
// ​}

// function computer(str) {
//   const num;
//   const result;
//   for(var i=0; i<str.lenght; i++) {
//     if(str[i]==='N'){
//       return aQb(a,b);
//     }else if(str[j]==='Q'){
//       return aNb(a,b);
//     }
//   }
//   //
//   return result;
// }

// function aQb(a, b) {
//   return a * b - (a + b);
// }
// function aNb(a, b) {
//   return a * a + b;
// }
// --------------以上为答题草稿

//                       1.题目描述
// 编程题
// 输入一串包含数字数组，去掉其中的重复元素后从小到大输出，例如：
// 输入：[10,1,3,5,58]
// 输出：[1,3,5,8,10]

//                       2.题目描述
// 牛小七有一个计算器，可以做复杂的运算。这个计算器只有两个运算符Q和N,其定义为：对于给定的两个整数a和b,
// - a Q b 表示 a * b - (a+b)
// - a N b 表示 a * a + b
// 计算器接受的运算表达式由数字、括号，以及Q/N组成，括号可用于包裹一段表达式，以指定运算的顺序。
// 请你实现这样一个计算器，输入为表达式字符串，输出为运算结果数字，如输入`"2Q(3N4)"`,返回`11`

//                       3. 题目描述
// 问一个浏览器中有多个标签页之间通信，有哪些实现方式？

//                       4.题目描述
// 将几个块元素组织在同一行里有哪些方式？并说出他们的不足。

//                       5.题目描述
// 你觉得十年后前端（或者客户端）开发会是什么样子的，可以从你想到的各种角度（三个即可）来说，比如分工与合作的模式、
// 技术方案、开发环境、开发内容、基础设施等，最好能描述一下你的依据。
